<?php
$str = '封面	-19
数字版权声明	-18
译者介绍	-17
扉页	-16
版权	-15
版权声明	-14
O’Reilly Media, Inc.介绍	-13
目录	-12
	前言	-8
	第1章　什么是JSON	深入理解（全）.indd:.142038
		1.1　JSON是一种数据交换格式	深入理解（全）.indd:.142042
		1.2　JSON独立于编程语言	深入理解（全）.indd:.142046
		1.3　专业术语和概念	深入理解（全）.indd:.142050
	第2章　JSON语法	深入理解（全）.indd:.142058
		2.1　JSON基于JavaScript对象字面量	深入理解（全）.indd:.142062
		2.2　名称-值对	深入理解（全）.indd:.142066
		2.3　正确的JSON语法	深入理解（全）.indd:.142070
		2.4　语法验证	深入理解（全）.indd:.142074
		2.5　JSON文件	深入理解（全）.indd:.142078
		2.6　JSON的媒体类型	深入理解（全）.indd:.142082
		2.7　专业术语和概念	深入理解（全）.indd:.142086
	第3章　JSON的数据类型	深入理解（全）.indd:.142094
		3.1　数据类型简介	深入理解（全）.indd:.142098
		3.2　JSON中的数据类型	深入理解（全）.indd:.142102
		3.3　JSON中的对象数据类型	深入理解（全）.indd:.142106
		3.4　JSON中的字符串类型	深入理解（全）.indd:.142111
		3.5　JSON中的数字类型	深入理解（全）.indd:.142115
		3.6　JSON中的布尔类型	深入理解（全）.indd:.142119
		3.7　JSON中的null类型	深入理解（全）.indd:.142123
		3.8　JSON中的数组类型	深入理解（全）.indd:.142127
		3.9　专业术语和概念	深入理解（全）.indd:.142131
	第4章　JSON Schema	深入理解（全）.indd:.142139
		4.1　验证的魔力	深入理解（全）.indd:.142143
		4.2　JSON Schema简介	深入理解（全）.indd:.142147
		4.3　专业术语和概念	深入理解（全）.indd:.142152
	第5章　JSON中的安全问题	深入理解（全）.indd:.142161
		5.1　客户端和服务端的关系	深入理解（全）.indd:.142165
		5.2　跨站请求伪造	深入理解（全）.indd:.142169
		5.3　注入攻击	深入理解（全）.indd:.142173
			5.3.1　跨站脚本攻击	深入理解（全）.indd:.142177
			5.3.2　安全漏洞：决策上的失误	深入理解（全）.indd:.142181
		5.4　专业术语和概念	深入理解（全）.indd:.142185
	第6章　JavaScript中的XMLHttpRequest 与Web API	深入理解（全）.indd:.142194
		6.1　Web API	深入理解（全）.indd:.142198
		6.2　JavaScript中的XMLHttpRequest对象	深入理解（全）.indd:.142202
		6.3　混乱的关系与共享的规则	深入理解（全）.indd:.142206
			6.3.1　跨域资源共享	深入理解（全）.indd:.142210
			6.3.2　JSON-P	深入理解（全）.indd:.142214
		6.4　专业术语和概念	深入理解（全）.indd:.142218
	第7章　JSON与客户端框架	深入理解（全）.indd:.142226
		7.1　jQuery和JSON	深入理解（全）.indd:.142230
		7.2　AngularJS	深入理解（全）.indd:.142235
		7.3　专业术语和概念	深入理解（全）.indd:.142239
	第8章　JSON与NoSQL	深入理解（全）.indd:.142247
		8.1　CouchDB数据库	深入理解（全）.indd:.142251
		8.2　CouchDB API	深入理解（全）.indd:.142255
		8.3　专业术语和概念	深入理解（全）.indd:.142259
	第9章　服务端的JSON	深入理解（全）.indd:.142267
		9.1　序列化、反序列化与请求JSON	深入理解（全）.indd:.142271
			9.1.1　ASP.NET	深入理解（全）.indd:.142276
			9.1.2　PHP	深入理解（全）.indd:.142280
		9.2　发送JSON HTTP请求的其他方式	深入理解（全）.indd:.142285
			9.2.1　Ruby on Rails	深入理解（全）.indd:.142289
			9.2.2　Node.js	深入理解（全）.indd:.142293
			9.2.3　Java	深入理解（全）.indd:.142297
		9.3　专业术语和概念	深入理解（全）.indd:.142301
	第10章　总结	深入理解（全）.indd:.142309
		10.1　作为配置文件的JSON	深入理解（全）.indd:.142313
		10.2　结语	深入理解（全）.indd:.142318
	作者简介	深入理解（全）.indd:.142322
	封面介绍	深入理解（全）.indd:.142326
	新书宣传页	111
关注图灵	113
看完了	115
';

//$pattern = '/(.*)\s+000(.*)(\n)/';
//
//$str = '关注图灵	257
//		B.4　Your Gists	254
//					Gist的菜单	252
//';
//
//preg_match_all($pattern, $str, $matches);
//
//var_dump($matches);
//exit;

$pattern = '/(.*)\s+[-p\d]+[\r\n]/';
$pattern = '/(.*)\s+[-p\w\.\*\d]+[\r\n]/';
$pattern = '/(.*)\s+[-p\w\.\*_:\d]+[\r\n]/';
$pattern = '/(.*)\s+[-p\w\.\*_:\d深入理解（全）]+[\r\n]/';
$replacement = '${1}${3}';

echo
'<pre>',
(preg_replace($pattern, $replacement, $str)),
'</pre>';
